## <font color = '#7FFFD4'> What are pandas?

**Pandas** is a Python library used to manipulate data sets.

It offers data cleaning, exploration and analysis.

### <font color = '#DEB887'> Import Pandas

In [146]:
# import pandas 

# import pandas using alias

In [147]:
import pandas as pd

In [148]:

import pandas as pd

### <font color = '#DEB887'>  DataFrames

\
Data sets in Pandas are generally multidimensional arrays, known as data frames.

In [149]:
data = {
  "calories": [420, 390, 390, 389, 340, 350, 342, 560, 340, 490],
  "duration": [50, 40, 40, 45, 56, 39,50, 51, 42, 43]
}

In [150]:

# data = dict()
df = pd.DataFrame(data)
# dataframe
df

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45
4       340        56
5       350        39
6       342        50
7       560        51
8       340        42
9       490        43

####  <font color = '#FF7F50'> Show data using the loc and iloc functions

# show the 2 first rows of the datafram by using loc

In [151]:

df.loc[[0,1],]

   calories  duration
0       420        50
1       390        40

In [152]:
df.loc[[3,5],] # 3e et 5e lignes

   calories  duration
3       389        45
5       350        39

In [153]:
df.loc[[0,1],'calories'] # Precision de la vrariable 'calories'

0    420
1    390
Name: calories, dtype: int64

In [154]:

# The four rows characterized by duration

df.loc[0:4, 'duration']

0    50
1    40
2    40
3    45
4    56
Name: duration, dtype: int64

In [155]:

# All variables
df.loc[0:4, :]

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45
4       340        56

# With loc we use the name of variable, but with iloc we use the index

In [156]:
# The four rows characterized by duration with iloc

df.iloc[0:4, 1]

0    50
1    40
2    40
3    45
Name: duration, dtype: int64

# En liste

In [157]:
df.iloc[0:4, [1]]

   duration
0        50
1        40
2        40
3        45

In [158]:
df.iloc[0:4, [0,1]]

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45

In [159]:
df.iloc[0:4, :1]

   calories
0       420
1       390
2       390
3       389

In [160]:
df.iloc[0:4, :2] # 0:4 ligne 0 a 4 \\\\ :2 = indice 0 a 2

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45

In [161]:
df.iloc[:4, :2]

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45

####  <font color = '#FF7F50'> Show data using the head and tail functions

In [162]:
df.head(10)

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45
4       340        56
5       350        39
6       342        50
7       560        51
8       340        42
9       490        43

In [163]:
df.tail(5)

   calories  duration
5       350        39
6       342        50
7       560        51
8       340        42
9       490        43

### <font color = '#DEB887'>  Charger des fichiers donn√©es dans un DataFrame

In [164]:
# import data from a csv file
df = pd.read_csv('data.csv')
df

    calories  duration        date
0      420.0      50.0  2022/05/05
1      390.0      40.0  2022/05/06
2      390.0      40.0  2022/05/06
3      389.0      45.0  2022/05/07
4      340.0      56.0  2022/05/08
5      350.0      39.0  2022/05/09
6      342.0      50.0  2022/05/02
7      560.0      51.0  2022/05/03
8      340.0      42.0  2022/05/10
9      490.0      43.0  2022/05/11
10       NaN      45.0  2022/05/12
11     450.0       NaN  2022/05/14

In [165]:
# import data from a csv excel

#df1 = pd.read_excel('data.xlsx')
#df1

In [166]:
# show data using head

In [167]:
# show the dimension of the data

df.shape

(12, 3)

In [168]:
# show the list of column names 
df.columns

Index(['calories', 'duration', 'date'], dtype='object')

In [169]:
# rename column names

df.rename(columns={'calories': 'Calories'})

    Calories  duration        date
0      420.0      50.0  2022/05/05
1      390.0      40.0  2022/05/06
2      390.0      40.0  2022/05/06
3      389.0      45.0  2022/05/07
4      340.0      56.0  2022/05/08
5      350.0      39.0  2022/05/09
6      342.0      50.0  2022/05/02
7      560.0      51.0  2022/05/03
8      340.0      42.0  2022/05/10
9      490.0      43.0  2022/05/11
10       NaN      45.0  2022/05/12
11     450.0       NaN  2022/05/14

In [170]:
# rename column names 

df.rename(columns={'calories': 'Calories'}, inplace=True)
df.head()

   Calories  duration        date
0     420.0      50.0  2022/05/05
1     390.0      40.0  2022/05/06
2     390.0      40.0  2022/05/06
3     389.0      45.0  2022/05/07
4     340.0      56.0  2022/05/08

# inplace=True change 'calories' en 'Calories' directement sur les donnees

In [171]:
# show indexes 
df.index

RangeIndex(start=0, stop=12, step=1)

In [172]:
df.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [173]:

# change the indexes
df.index = ['day' + str(i) for i in range(df.shape[0])]

df.head()

      Calories  duration        date
day0     420.0      50.0  2022/05/05
day1     390.0      40.0  2022/05/06
day2     390.0      40.0  2022/05/06
day3     389.0      45.0  2022/05/07
day4     340.0      56.0  2022/05/08

In [174]:
# Describe the data 
df.describe()

         Calories   duration
count   11.000000  11.000000
mean   405.545455  45.545455
std     70.460434   5.502066
min    340.000000  39.000000
25%    346.000000  41.000000
50%    390.000000  45.000000
75%    435.000000  50.000000
max    560.000000  56.000000

In [175]:
# Describe the data 
df.describe(include = 'all') # unique indique le mode

          Calories   duration        date
count    11.000000  11.000000          12
unique         NaN        NaN          11
top            NaN        NaN  2022/05/06
freq           NaN        NaN           2
mean    405.545455  45.545455         NaN
std      70.460434   5.502066         NaN
min     340.000000  39.000000         NaN
25%     346.000000  41.000000         NaN
50%     390.000000  45.000000         NaN
75%     435.000000  50.000000         NaN
max     560.000000  56.000000         NaN

In [176]:
# Infos of the data

### <font color = '#DEB887'> Pandas - Data Cleaning

In [177]:
# import data.csv

In [178]:
# Check the existence of null values 
df.isnull().sum()

Calories    1
duration    1
date        0
dtype: int64

In [179]:
df.isna().sum()

Calories    1
duration    1
date        0
dtype: int64

In [180]:
df.isnull().any().sum() # The number of the variable containing the missing values

np.int64(2)

In [181]:
# Delete null values using dropna 
#df.dropna() # Pas d'effet sur les donnees originales donc on ajout l'argument replace

In [182]:
df.dropna(inplace = True)

In [183]:
df.isnull().sum()

Calories    0
duration    0
date        0
dtype: int64

In [184]:
# Replace null values by the mean
# import data.csv

We replace NaN by mean if it is numerique variable and by median if it is the chr variables

In [185]:
# Replace null values by the median 
# import data.csv
df = pd.read_csv('data.csv')
df.isnull().sum()

calories    1
duration    1
date        0
dtype: int64

In [186]:
for col in ['calories','duration'] :
    df[col] = df[col].fillna(df[col].mean())

In [187]:
df

      calories   duration        date
0   420.000000  50.000000  2022/05/05
1   390.000000  40.000000  2022/05/06
2   390.000000  40.000000  2022/05/06
3   389.000000  45.000000  2022/05/07
4   340.000000  56.000000  2022/05/08
5   350.000000  39.000000  2022/05/09
6   342.000000  50.000000  2022/05/02
7   560.000000  51.000000  2022/05/03
8   340.000000  42.000000  2022/05/10
9   490.000000  43.000000  2022/05/11
10  405.545455  45.000000  2022/05/12
11  450.000000  45.545455  2022/05/14

In [188]:
#for col in ['calories','duration'] :
#    df[col] = df[col].fillna(df[col].mean(), inplace = True)

In [189]:
df.isnull().sum()

calories    0
duration    0
date        0
dtype: int64

In [190]:
# Replace null values by the mode 
# import data.csv

df = pd.read_csv('data.csv')

In [191]:
df

    calories  duration        date
0      420.0      50.0  2022/05/05
1      390.0      40.0  2022/05/06
2      390.0      40.0  2022/05/06
3      389.0      45.0  2022/05/07
4      340.0      56.0  2022/05/08
5      350.0      39.0  2022/05/09
6      342.0      50.0  2022/05/02
7      560.0      51.0  2022/05/03
8      340.0      42.0  2022/05/10
9      490.0      43.0  2022/05/11
10       NaN      45.0  2022/05/12
11     450.0       NaN  2022/05/14

In [192]:
for col in ['calories','duration'] :
    df[col].fillna(df[col].median(), inplace = True)

/tmp/ipykernel_129702/2235679897.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].median(), inplace = True)
/tmp/ipykernel_129702/2235679897.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].median(), inplace = True)

In [193]:
df

    calories  duration        date
0      420.0      50.0  2022/05/05
1      390.0      40.0  2022/05/06
2      390.0      40.0  2022/05/06
3      389.0      45.0  2022/05/07
4      340.0      56.0  2022/05/08
5      350.0      39.0  2022/05/09
6      342.0      50.0  2022/05/02
7      560.0      51.0  2022/05/03
8      340.0      42.0  2022/05/10
9      490.0      43.0  2022/05/11
10     390.0      45.0  2022/05/12
11     450.0      45.0  2022/05/14

# Replace null values by the mode 
# import data.csv

for col in [']
df.calories.mode()

In [194]:
# Check the types of the different variables 
df.dtypes

calories    float64
duration    float64
date         object
dtype: object

In [195]:
# Convert calories in integer using astype 
# import data1.csv


df['duration'] = df['duration'].astype('int')

In [196]:
# convert data in datetime64 using astype 
df.data = df.date.astype('datetime64[ns]')
df.data

/tmp/ipykernel_129702/1943714599.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.data = df.date.astype('datetime64[ns]')

0    2022-05-05
1    2022-05-06
2    2022-05-06
3    2022-05-07
4    2022-05-08
5    2022-05-09
6    2022-05-02
7    2022-05-03
8    2022-05-10
9    2022-05-11
10   2022-05-12
11   2022-05-14
Name: date, dtype: datetime64[ns]

In [197]:
# Delete rows (axis = 0) 
df.drop([0:2], axis = 0, inplace = True)
df.head()

SyntaxError: invalid syntax (2618790652.py, line 2)

In [198]:
# Delete columns (axis = 1)

df.drop(['calories'], axis=1, inplace = True)

In [209]:
# Check the existence of duplicates 
# import data2.csv
df = pd.read_csv('data2.csv')
df

    calories  duration        date
0        420        50  2022-05-05
1        390        40  2022-05-06
2        390        40  2022-05-06
3        389        45  2022-05-07
4        340        56  2022-05-08
5        350        39  2022-05-09
6        342        50  2022-05-02
7        560        51  2022-05-03
8        340        42  2022-05-10
9        490        43  2022-05-11
10       450        45  2022-05-12

In [210]:
df.duplicated().sum()

np.int64(1)

In [213]:
# Delete duplicates 
df.drop_duplicates(inplace = True)

In [214]:
df.duplicated().sum()

np.int64(0)

In [215]:
data1 = {
  "calories": [420, 390, 390],
  "duration": [50, 40, 40]
}

data2 = {
  "calories": [ 389, 340, 350],
  "duration": [45, 56, 39]
}

data3 = {
  "fist_name": [  'Aliou', 'Baba', 'Samir'],
  "second_name": ['Afi', "Kodjo", "Kamil"]
}

In [216]:
df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2)

df3 = pd.DataFrame(data3)

In [221]:
# Concatenation df1 and df2 horizontaly or contatenate df1 and df2 rows

df = pd.concat([df1,df2], axis=0)

In [222]:
df

   calories  duration
0       420        50
1       390        40
2       390        40
0       389        45
1       340        56
2       350        39

In [225]:
df = pd.concat([df1,df2], axis=0).reset_index(drop = True)
df

   calories  duration
0       420        50
1       390        40
2       390        40
3       389        45
4       340        56
5       350        39

In [226]:
DF = pd.concat([df1,df3], axis=1).reset_index(drop = True)
DF

   calories  duration fist_name second_name
0       420        50     Aliou         Afi
1       390        40      Baba       Kodjo
2       390        40     Samir       Kamil

In [228]:
DF1 = pd.concat([df3,df1], axis=1).reset_index(drop = True)
DF1

  fist_name second_name  calories  duration
0     Aliou         Afi       420        50
1      Baba       Kodjo       390        40
2     Samir       Kamil       390        40

In [229]:
DF2 = pd.concat([df3,df3], axis=1).reset_index(drop = True)
DF2

  fist_name second_name fist_name second_name
0     Aliou         Afi     Aliou         Afi
1      Baba       Kodjo      Baba       Kodjo
2     Samir       Kamil     Samir       Kamil

In [230]:
DF1 = pd.concat([df3,df1], axis=1).reset_index(drop = True)
DF1

  fist_name second_name  calories  duration
0     Aliou         Afi       420        50
1      Baba       Kodjo       390        40
2     Samir       Kamil       390        40

In [ ]:
# Download the dataframe in csv

In [234]:
DF.to_csv('data_DF.csv', index = True, header = True)

In [235]:
DF.to_excel('data_DF1.xlsx', index = True, header = True)